import React from 'react';

import './Footer.scss';
import LazyLoadImage from '../../components/LazyLoadImage/LazyLoadImage';


const Footer = () => {
  return (
    <footer className="footer">
      <div className="footer__logo">
        <LazyLoadImage src='/media/logo.png' />
      </div>

      <div className="footer__item">
        <h3 className="footer__item-title">Документы</h3>

        <ul className="footer__links">
          <li className="footer__link">Условия использования</li>
          <li className="footer__link">Политика Конфиденциальности</li>
        </ul>
      </div>

      <div className="footer__item">
        <h3 className="footer__item-title">Контакты</h3>

        <div className="footer__social-networks-wrap">
          <div className="footer__social-network footer__social-network--active">
            <svg
              width='14'
              height='14'
              viewBox="0 0 512 512"
            >
              <path d="M288 176v-64c0-17.664 14.336-32 32-32h32V0h-64c-53.024 0-96 42.976-96 96v80h-64v80h64v256h96V256h64l32-80h-96z" />
            </svg>
          </div>

          <div className="footer__social-network">
            <svg
              width='14'
              height='14'
              viewBox="0 0 24 24"
            >
              <path d="M12.004 5.838c-3.403 0-6.158 2.758-6.158 6.158 0 3.403 2.758 6.158 6.158 6.158 3.403 0 6.158-2.758 6.158-6.158 0-3.403-2.758-6.158-6.158-6.158zm0 10.155c-2.209 0-3.997-1.789-3.997-3.997s1.789-3.997 3.997-3.997 3.997 1.789 3.997 3.997c.001 2.208-1.788 3.997-3.997 3.997z" /><path d="M16.948.076c-2.208-.103-7.677-.098-9.887 0-1.942.091-3.655.56-5.036 1.941C-.283 4.325.012 7.435.012 11.996c0 4.668-.26 7.706 2.013 9.979 2.317 2.316 5.472 2.013 9.979 2.013 4.624 0 6.22.003 7.855-.63 2.223-.863 3.901-2.85 4.065-6.419.104-2.209.098-7.677 0-9.887-.198-4.213-2.459-6.768-6.976-6.976zm3.495 20.372c-1.513 1.513-3.612 1.378-8.468 1.378-5 0-7.005.074-8.468-1.393-1.685-1.677-1.38-4.37-1.38-8.453 0-5.525-.567-9.504 4.978-9.788 1.274-.045 1.649-.06 4.856-.06l.045.03c5.329 0 9.51-.558 9.761 4.986.057 1.265.07 1.645.07 4.847-.001 4.942.093 6.959-1.394 8.453z" /><circle cx="18.406" cy="5.595" r="1.439" />
            </svg>
          </div>

          <div className="footer__social-network">
            <svg
              width='14'
              height='14'
              viewBox="0 0 512 512"
            >
              <path d="M490.24 113.92c-13.888-24.704-28.96-29.248-59.648-30.976C399.936 80.864 322.848 80 256.064 80c-66.912 0-144.032.864-174.656 2.912-30.624 1.76-45.728 6.272-59.744 31.008C7.36 138.592 0 181.088 0 255.904v.256c0 74.496 7.36 117.312 21.664 141.728 14.016 24.704 29.088 29.184 59.712 31.264C112.032 430.944 189.152 432 256.064 432c66.784 0 143.872-1.056 174.56-2.816 30.688-2.08 45.76-6.56 59.648-31.264C504.704 373.504 512 330.688 512 256.192v-.16-.096c0-74.848-7.296-117.344-21.76-142.016zM192 352V160l160 96-160 96z" />
            </svg>
          </div>
        </div>
      </div>
    </footer>
  )
}

export default Footer;